ProyectoWeb2/app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    token = request.headers['token']
    is_login(token)
      @products = Product.all

INSERT INTO "products" ("nombre", "descripcion", "estado", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", "arroz"], ["descripcion", "paquete"], ["estado", "activo"], ["created_at", "2015-04-13 15:45:43.640542"], ["updated_at", "2015-04-13 15:45:43.640542"]]
---
  def create
#render plain: params
  token = request.headers['token']
  #if is_login_post(token)

    @product = Product.new(product_params)
    respond_to do |format|
      if is_login_post(token)
        if @product.save