ProyectoWeb2/app/controllers/tokens_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "demo"]]
---
  def create
      # tomamos las variables del POST
      username = params[:username]
      password = params[:password]
      #savePass = params[:password]
      # aquí mandamos un mensaje por si no nos hacen un post a /tokens sin .json
      if request.format == :json
          render :status=>406, :json=>{:message=>"solo se aceptan peticiones json :(" + username + password}
          return
      end

      # aquí mandamos un mensaje por si no nos mandaron las variables email o password
      if username.nil? || password.nil?
          render :status=>400,
          :json=>{:message=>"Algo anda mal con tu POST :("}
          return
      end

      #buscamos el usuario por el usuario
  	 @user = User.find_by_username(username)