ProyectoWeb2/app/controllers/users_controller.rb

  def create

    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "password", "token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "elias"], ["password", "123"], ["token", ""], ["created_at", "2015-04-12 17:02:23.999901"], ["updated_at", "2015-04-12 17:02:23.999901"]]

  def update

    @user = User.authenticate(user_params)
     #generamos el token y lo guardamos
      #@user.ensure_authentication_token!

    if @user
        respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "token" = ?, "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["token", ""], ["password", "$2a$10$dJO0/AqtRAPxTTw1Mfdlzu"], ["updated_at", "2015-04-12 19:11:10.554599"], ["id", 3]]